deployment/app/Models/AbsensiModel.php

SELECT `id`, `nipd`, `nama`, `kelas`, `nisn`
FROM `tb_siswa`
WHERE `deleted_at` IS NULL
AND `kelas` = 'Kelas 5 A'
ORDER BY `nama` ASC
---
    public function getDetailedAttendanceRecap($year, $month, $kelasId = null)
    {
        // Ensure month is zero-padded
        $monthStr = str_pad($month, 2, '0', STR_PAD_LEFT);
        $startDate = "$year-$monthStr-01";
        $endDate = date('Y-m-t', strtotime($startDate));
        $daysInMonth = date('t', strtotime($startDate));

        // Create array of days for the month
        $days = [];
        for ($i = 1; $i <= $daysInMonth; $i++) {
            $days[] = $i;
        }

        // Get all students for the class
        $studentBuilder = db_connect()->table('tb_siswa')
            ->select('id, nipd, nama, kelas, nisn')
            ->where('deleted_at IS NULL');

        if ($kelasId) {
            $studentBuilder->where('kelas', $kelasId);
        }

        $students = $studentBuilder->orderBy('nama', 'ASC')->get()->getResultArray();