deployment/app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = '199303292019031011'
AND `is_active` = 1
 LIMIT 1
UPDATE `users` SET `last_login` = '2025-07-13 11:43:27', `updated_at` = '2025-07-13 11:43:27'
WHERE `users`.`id` IN ('2')
---
    public function authenticate(string $username, string $password): ?array
    {
        $user = $this->where('username', $username)
                     ->where('is_active', 1)
                     ->first();

        if ($user && password_verify($password, $user['password'])) {
            // Update last login
            $this->update($user['id'], ['last_login' => date('Y-m-d H:i:s')]);

SELECT `users`.*, `walikelas`.`kelas`, `walikelas`.`nip` as `walikelas_nip`
FROM `users`
LEFT JOIN `walikelas` ON `users`.`walikelas_id` = `walikelas`.`id`
WHERE `users`.`id` = 2
 LIMIT 1
---
    public function getUserWithWalikelas(int $userId): ?array
    {
        return $this->select('users.*, walikelas.kelas, walikelas.nip as walikelas_nip')
                    ->join('walikelas', 'users.walikelas_id = walikelas.id', 'left')
                    ->where('users.id', $userId)
                    ->first();