deployment/app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $session = session();

        // Check if user is logged in
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userModel = new UserModel();
        $guruModel = new GuruModel();
        $siswaModel = new SiswaModel();

        // Get current user info with walikelas data if applicable
        $currentUser = $userModel->getUserWithWalikelas($session->get('user_id'));

        // Dashboard statistics
        $totalGuru = $guruModel->countAllResults();
        $totalWalikelas = $userModel->where('role', 'walikelas')->where('is_active', 1)->countAllResults();
        $totalUsers = $userModel->where('is_active', 1)->countAllResults();
        $siswaStats = $siswaModel->getStatistics();

        $data = [
            'currentUser' => $currentUser,
            'totalGuru' => $totalGuru,
            'totalWalikelas' => $totalWalikelas,
            'totalUsers' => $totalUsers,
            'totalSiswa' => $siswaStats['total'],
            'siswaLaki' => $siswaStats['laki_laki'],
            'siswaPerempuan' => $siswaStats['perempuan'],
            'recentGuru' => $guruModel->orderBy('created_at', 'DESC')->findAll(5),
            'recentSiswa' => $siswaModel->orderBy('created_at', 'DESC')->findAll(5)
---
SELECT COUNT(*) AS `numrows`
FROM `tb_guru`
WHERE `tb_guru`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'walikelas'
AND `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_active` = 1
SELECT *
FROM `tb_guru`
WHERE `tb_guru`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `tb_siswa`
WHERE `tb_siswa`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 5